import re

def check_ukrainian_car_number(number):
    # Перевірка чи відповідає номер заданому формату
    pattern = r"^[АВЕІКМНОРСТУХ]{2}\d{4}[АВЕІКМНОРСТУХ]{2}$"
    if re.match(pattern, number, re.IGNORECASE):
        # Визначення регіону
        regions_2004 = {"АА": "Київ", "АВ": "Вінницька", "АЕ": "Житомирська", "АК": "Волинська", "АМ": "Донецька",
                         "АН": "Дніпропетровська", "АО": "Житомирська", "АР": "Закарпатська", "АС": "Запорізька",
                         "АТ": "Івано-Франківська", "АУ": "Київська", "АХ": "Харківська", "АІ": "Київ",
                         "АІ": "Київ",
                         "ВА": "Київ", "ВВ": "Вінницька", "ВЕ": "Волинська", "ВК": "Донецька", "ВМ": "Дніпропетровська",
                         "ВН": "Донецька", "ВО": "Донецька", "ВР": "Житомирська", "ВС": "Закарпатська",
                         "ВТ": "Запорізька",
                         "ВУ": "Київська", "ВХ": "Харківська", "ВІ": "Київ", "ВІ": "Київ"}
        regions_2013 = {"АА": "Київ", "АВ": "Вінницька", "АС": "Волинська", "АЕ": "Дніпропетровська", "АН": "Донецька",
                         "АН": "Донецька",
                         "АО": "Дніпропетровська", "АО": "Дніпропетровська", "АР": "Житомирська", "АН": "Донецька",
                         "АС": "Дніпропетровська", "АТ": "Дніпропетровська", "АУ": "Дніпропетровська", "АХ": "Донецька",
                         "АІ": "Київ", "ВА": "Київ", "ВВ": "Вінницька", "ВЕ": "Волинська", "ВК": "Дніпропетровська",
                         "ВМ": "Донецька",
                         "ВН": "Донецька", "ВО": "Донецька", "ВР": "Донецька", "ВС": "Дніпропетровська",
                         "ВС": "Дніпропетровська", "ВТ": "Дніпропетровська", "ВУ": "Донецька", "ВХ": "Донецька",
                         "ВХ": "Донецька",
                         "ВІ": "Київ", "ВІ": "Київ"}

        region_code = number[:2].upper()
        if region_code in regions_2004:
            return True, regions_2004[region_code]
        elif region_code in regions_2013:
            return True, regions_2013[region_code]
    return False, None

# Приклад використання
car_number = input("Введіть номер автомобіля: ")
is_car_number, region = check_ukrainian_car_number(car_number)
if is_car_number:
    print(f"Це український номер автомобіля. Регіон: {region}")
else:
    print("Це не є українським номером автомобіля.")
