print("a:", ("Виведіть третій символ цього рядка.")[2])
print("b:", ("виведіть передостанній символ цього рядка")[-2])
print("c:", ("виведіть перші п'ять символів цього рядка")[0:5])
print("d:", ("виведіть весь рядок, крім двох останніх символів")[:-2])
print("e:", ("виведіть усі символи з парними індексами.")[::2])
print("f:", ("виведіть усі символи з непарними індексами.")[1::2])
print("g:", ("виведіть усі символи у зворотному порядку.")[::-1])
print("h:", ("виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.")[-1::-2])
print("i:", len("виведіть довжину цього рядка."))



